<a href="https://colab.research.google.com/github/GitHubrenu/ProgrammingAssignment2/blob/master/PandasAssignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
 
!pip install pymysql
 import io
import sqlite3
import pymysql as MySQL
 
conn = sqlite3.connect('sqlitedbase.db')

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.9.3)

In [ ]:
 conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')
 
conn.commit()
 
print("Table created successfully");

Table created successfully

In [ ]:
 conn.execute('''CREATE TABLE students (roll integer, name text, class integer, addr text);''')

In [ ]:
 # INSERTING VALUES
 
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")
 
conn.commit()

In [ ]:
 
# INSERTING VALUES
 
conn.execute("INSERT INTO students VALUES(1,'Real Madrid',   2, 'Aurangabad');")
conn.execute("INSERT INTO students VALUES(2,'A.R. Gupta', 9, 'Aurangabad');")
conn.execute("INSERT INTO students VALUES(3, 'A. V. Rathi', 2, 'Dilhi');")
conn.execute("INSERT INTO students VALUES(4, 'B.V. Borade' ,2, 'Delhi');")
conn.execute("INSERT INTO students VALUES(5, 'S.B. Shinde', 8, 'Aurangabad');")
conn.execute("INSERT INTO students VALUES(6,'V.B.Budhwant',8, 'Delhi');")
 
conn.commit()

In [ ]:
import pandas as pd
df = pd.read_sql_query(" select * from students ",conn)
df

   roll          name  class        addr
0     1   Real Madrid      2  Aurangabad
1     2    A.R. Gupta      9  Aurangabad
2     3   A. V. Rathi      2       Dilhi
3     4   B.V. Borade      2       Delhi
4     5   S.B. Shinde      8  Aurangabad
5     6  V.B.Budhwant      8       Delhi

In [ ]:
 df2 = pd.read_sql_query(" select * from team_data",conn)
df2

          team country  season  total_goals
0  Real Madrid   Spain    2019           53
1    Barcelona   Spain    2019           47
2      Arsenal      UK    2019           52
3  Real Madrid   Spain    2018           49
4    Barcelona   Spain    2018           45
5      Arsenal      UK    2018           50

In [ ]:
df.info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    6 non-null      int64
 1   name    6 non-null      object
 2   class   6 non-null      int64
 3   addr    6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   team         6 non-null      object
 1   country      6 non-null      object
 2   season       6 non-null      int64
 3   total_goals  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [ ]:
df.head(3)

   roll         name  class        addr
0     1  Real Madrid      2  Aurangabad
1     2   A.R. Gupta      9  Aurangabad
2     3  A. V. Rathi      2       Dilhi

In [ ]:
df2.head(2)

          team country  season  total_goals
0  Real Madrid   Spain    2019           53
1    Barcelona   Spain    2019           47

In [ ]:
df.tail(3)

   roll          name  class        addr
3     4   B.V. Borade      2       Delhi
4     5   S.B. Shinde      8  Aurangabad
5     6  V.B.Budhwant      8       Delhi

In [ ]:
df[2:5]

   roll         name  class        addr
2     3  A. V. Rathi      2       Dilhi
3     4  B.V. Borade      2       Delhi
4     5  S.B. Shinde      8  Aurangabad

In [ ]:
 df.set_index("name" ,inplace=True)
df

              roll  class        addr
name
Real Madrid      1      2  Aurangabad
A.R. Gupta       2      9  Aurangabad
A. V. Rathi      3      2       Dilhi
B.V. Borade      4      2       Delhi
S.B. Shinde      5      8  Aurangabad
V.B.Budhwant     6      8       Delhi

In [ ]:
 df.loc["Real Madrid" : "B.V. Borade"]

             roll  class        addr
name
Real Madrid     1      2  Aurangabad
A.R. Gupta      2      9  Aurangabad
A. V. Rathi     3      2       Dilhi
B.V. Borade     4      2       Delhi

In [ ]:
 df.loc[df['class']>7]

              roll  class        addr
name
A.R. Gupta       2      9  Aurangabad
S.B. Shinde      5      8  Aurangabad
V.B.Budhwant     6      8       Delhi

In [ ]:
 
df.loc[(df['class']>7) & (df['class']<9)]

              roll  class        addr
name
S.B. Shinde      5      8  Aurangabad
V.B.Budhwant     6      8       Delhi

In [ ]:
 df.loc[df['class']== 9]

            roll  class        addr
name
A.R. Gupta     2      9  Aurangabad

In [1]:
 
#read json file
 
 
from google.colab import files
data_to_load = files.upload()

Saving sample-json.json to sample-json.json

In [10]:
 import pandas as pd
import json
from pandas.io.json import json_normalize

In [3]:
 
import io
f=open ('sample-json.json')
data=json.load(f)
data

{'address': {'city': 'san jone',
  'postalCode': '394221',
  'state': 'CA',
  'streetAddress': '126 Udhna'},
 'age': 24,
 'firstName': 'Rack',
 'gender': 'man',
 'lastName': 'jackson',
 'phoneNumbers': [{'number': '7383627627', 'type': 'home'}]}

In [5]:
dataframe= json_normalize(data)
dataframe

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  """Entry point for launching an IPython kernel.

  firstName lastName gender  ...  address.city address.state address.postalCode
0      Rack  jackson    man  ...      san jone            CA             394221

[1 rows x 9 columns]